In [1]:
import pandas as pd 
import numpy as np

# Agregar y agrupar datos

In [2]:
df_group= pd.read_csv('data/linkeding-jobs-usa-clean.csv')

In [3]:
df_group.head(10)

,title,company,description,onsite_remote,location,criteria,posted_date,link,salary_num
0,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...,100000.0
1,Data Analyst,"Eva Garland Consulting, LLC","Reporting to the Director of Operations, the D...",onsite,"Raleigh, NC","[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...,50000.0
2,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...,100000.0
3,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...,100000.0
4,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...,100000.0
5,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...,100000.0
6,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...,100000.0
7,Data Analyst,"Eva Garland Consulting, LLC","Reporting to the Director of Operations, the D...",onsite,"Raleigh, NC","[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...,50000.0
8,Data Analyst,KLA,Company OverviewKLA is a global leader in dive...,onsite,"Ann Arbor, MI","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...,100000.0
9,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...,100000.0

buscare crea una tabla donde se agrupen datos y sea mas facil la comprencion de los mismos buscare crear una tabla con las columnas 'title' y 'salary'. 
Agrupar por t√≠tulo (que sea unico) y calcular el promedio y la mediana del salario para cada registro

In [5]:
df_grouped = df_group.groupby('title')['salary_num'].agg(['mean', 'median', 'count']).reset_index()

In [8]:
df_grouped.head()

                          title         mean   median  count
0  Analyst - Data Visualization  80000.00000  80000.0     35
1                  Data Analyst  90894.12037  85000.0    432
2         Data Analyst (Hybrid)  80000.00000  80000.0      1
3            Data Analyst (SQL)  73800.00000  75000.0     25
4         Data Analyst - Energy  80000.00000  80000.0      1

In [9]:
# Renombrare las columnas para mayor claridad
df_grouped.columns = ['title', 'salary_mean', 'salary_median', 'job_count']

In [13]:
df_grouped

,title,salary_mean,salary_median,job_count
0,Analyst - Data Visualization,80000.00000,80000.0,35
1,Data Analyst,90894.12037,85000.0,432
2,Data Analyst (Hybrid),80000.00000,80000.0,1
3,Data Analyst (SQL),73800.00000,75000.0,25
4,Data Analyst - Energy,80000.00000,80000.0,1
5,Data Analyst/ $100M Valuation/ Hybrid,120000.00000,120000.0,1
6,Data Analyst/Collector,55000.00000,55000.0,1
7,"REMOTE Data Analyst (SQL, Operations)",80000.00000,80000.0,2

redondearemos los datos para una mejor claridad

In [14]:
df_grouped['salary_mean'] = df_grouped['salary_mean'].round(0).astype(int)
df_grouped['salary_median'] = df_grouped['salary_median'].round(0).astype(int)

In [15]:
df_grouped

,title,salary_mean,salary_median,job_count
0,Analyst - Data Visualization,80000,80000,35
1,Data Analyst,90894,85000,432
2,Data Analyst (Hybrid),80000,80000,1
3,Data Analyst (SQL),73800,75000,25
4,Data Analyst - Energy,80000,80000,1
5,Data Analyst/ $100M Valuation/ Hybrid,120000,120000,1
6,Data Analyst/Collector,55000,55000,1
7,"REMOTE Data Analyst (SQL, Operations)",80000,80000,2

Asi damos fin a este proyecto ya podremos exportarlo par autilizarlo

In [ ]:
df_grouped.to_csv('data/linkeding-jobs-usa-clean_agg.csv',index=False) #exportamos